[ 
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/6/6b/WhatsApp.svg",
    "title": "WhatsApp Messenger",
    "companyName": "WhatsApp LLC",

    "id":1,
   "description": "WhatsApp Messenger offers a fast, simple, and secure way to connect with people globally. Built on the principle of private communication, it uses end-to-end encryption to ensure that only you and the person you're communicating with can read or listen to what is sent. Beyond one-on-one chats, it supports robust group chats, high-quality voice and video calls, and Status updates to share moments from your day. It’s a complete communication tool designed to be reliable even on slow networks, making it an essential part of daily life for billions.\n\nA key feature of WhatsApp is its versatility. Users can share photos, videos, documents, and voice messages effortlessly. The platform has expanded to include WhatsApp Business, allowing small companies to connect with their customers professionally. Group video calls connect up to eight people, making it easy to stay in touch with family, friends, or colleagues. The app is also entirely ad-free, focusing purely on providing a seamless and uninterrupted communication experience across mobile and desktop devices through its web and desktop apps.\n\nFor anyone looking for a dependable and private communication tool, WhatsApp is the go-to choice. It bridges geographical distances, allowing you to have personal conversations or manage professional discussions without worrying about privacy or cost. Its simple interface makes it accessible to all ages, while its powerful features ensure it can handle all your messaging needs. It's more than just an app; it's a vital link to the people who matter most, keeping you connected anytime, anywhere.",
    "size": 55,
    "reviews":50 ,
    "ratingAvg": 4.2,
    "downloads":5,
    "ratings": [
      { "name": "1 star", "count": 25100000 },
      { "name": "2 star", "count": 10500000 },
      { "name": "3 star", "count": 15800000 },
      { "name": "4 star", "count": 28150123 },
      { "name": "5 star", "count": 102000000 }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/a/a5/Instagram_icon.png",
    "title": "Instagram",
    "companyName": "Instagram",
    "id": 2,
     "description": "Instagram is a vibrant social network centered around sharing visual stories through photos and videos. It provides a platform for users to express their creativity, share life moments, and connect with a global community. The core of the experience is the feed, where you see updates from friends, family, and creators you follow. The platform has evolved beyond simple photo sharing, becoming a cultural hub where trends are born, and new ideas are discovered. Its design is intuitive and visually driven, encouraging users to capture and share the world around them beautifully.\n\nA unique strength of Instagram lies in its diverse content formats. 'Stories' allow for ephemeral, day-in-the-life updates, while 'Reels' offer a space for short, entertaining videos powered by a vast library of music and effects. For longer content, there's IGTV. The platform also features robust direct messaging, shopping capabilities that turn inspiration into purchase, and powerful creative tools like AR filters. This multi-faceted approach allows creators and users to engage in a variety of ways, from casual sharing to building a professional brand.\n\nFor those who want to connect visually, Instagram is an indispensable tool. It’s a place to find inspiration for your hobbies, follow the journeys of your favorite personalities, and stay updated on the latest in fashion, food, and travel. By combining social networking with powerful creative tools and e-commerce, Instagram offers a dynamic space where you can not only consume content but also create, share, and connect in a meaningful and visually compelling way.",
    "size": 85,
    "reviews": 146,
    "ratingAvg": 4.3,
    "downloads":4,
    "ratings": [
      { "name": "1 star", "count": 14100000 },
      { "name": "2 star", "count": 6200000 },
      { "name": "3 star", "count": 10800000 },
      { "name": "4 star", "count": 20134888 },
      { "name": "5 star", "count": 95000000 }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/5/51/Facebook_f_logo_%282019%29.svg",
    "title": "Facebook",
    "companyName": "Meta Platforms, Inc.",
    "id": 3,
    "description": "Facebook is the original social network that connects you with friends, family, and communities across the globe. Its core feature is the News Feed, a personalized stream of updates, photos, and videos from people and pages you follow. It allows you to share what's on your mind, celebrate life events, and see what's new with everyone you know. The platform is designed to help you maintain and strengthen your real-world relationships in a digital space, making it a cornerstone of modern social interaction.\n\nOne of Facebook's unique strengths is its comprehensive set of features for community building. 'Groups' allow you to connect with people who share your interests or hobbies, creating dedicated spaces for discussion and sharing. 'Events' help you discover and organize local gatherings, from concerts to community meetings. Furthermore, 'Marketplace' provides a platform for buying and selling goods within your local community. This combination of personal updates and community tools makes Facebook a multi-functional social hub.\n\nFor people looking to stay connected, Facebook offers a rich and interactive environment. It’s a place to keep up with old friends, discover local happenings, and join conversations about topics you care about. By providing tools for sharing, communication, and community engagement, the platform serves as a digital scrapbook of your life and a window into the lives of others. It remains an essential tool for navigating your social world.",
    "size": 78,
    "reviews": 125,
    "ratingAvg": 3.4,
    "downloads": 10,
    "ratings": [
      { "name": "1 star", "count": 35100000 },
      { "name": "2 star", "count": 15200000 },
      { "name": "3 star", "count": 14800000 },
      { "name": "4 star", "count": 15012950 },
      { "name": "5 star", "count": 45000000 }
    ]
  },
  {
     "image": "https://downloadr2.apkmirror.com/wp-content/uploads/2024/06/73/66790e842e292_com.kiloo.subwaysurf.png",
    "title": "Subway Surfers",
    "companyName": "SYBO Games",
    "id": 4,
    "description": "Subway Surfers is a classic and vibrant endless runner game that has captivated millions worldwide. The premise is simple yet addictive: you dash through a vivid and dynamic subway system, dodging oncoming trains and obstacles while being chased by a grumpy Inspector and his dog. The controls are incredibly intuitive—just swipe left, right, up, or down to navigate. The game’s fast-paced action and colorful graphics create an exhilarating experience that keeps you coming back for more, trying to beat your previous high score.\n\nThe game's enduring appeal comes from its constant stream of new content. Each month, the World Tour takes players to a new city, completely changing the visual theme and introducing new characters and hoverboards to collect. Players can grab various power-ups like jetpacks, super sneakers, and coin magnets to extend their runs and boost their scores. Daily challenges and weekly hunts provide specific goals to achieve, adding another layer of engagement beyond just endless running.\n\nFor anyone seeking a fun, fast-paced, and visually engaging mobile game, Subway Surfers is a perfect choice. It’s easy to pick up and play for a few minutes, but it has enough depth and unlockable content to keep you entertained for hours. The game is a test of reflexes and concentration, offering a satisfying sense of accomplishment as you master the tracks and climb the leaderboards. It’s a timeless classic that continues to deliver high-speed fun and adventure.",
    "size": 152,
    "reviews": 60,
    "ratingAvg": 4.5,
    "downloads":6,
    "ratings": [
      { "name": "1 star", "count": 4800000 },
      { "name": "2 star", "count": 1900000 },
      { "name": "3 star", "count": 3100000 },
      { "name": "4 star", "count": 6650230 },
      { "name": "5 star", "count": 45000000 }
    ]
  },
  {
   "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/12/Google_Drive_icon_%282020%29.svg/2295px-Google_Drive_icon_%282020%29.svg.png",
    "title": "Google Drive",
    "companyName": "Google LLC",
    "id": 5,
    "description": "Google Drive is a secure cloud storage service that provides a safe home for all your files. It allows you to store, share, and access your photos, documents, videos, and other files from any device, anywhere in the world. With a generous amount of free storage, it offers a convenient way to back up your important data and free up space on your devices. The service is designed to be a central hub for your digital life, keeping everything organized and easily accessible.\n\nA key feature of Google Drive is its seamless integration with Google's suite of productivity apps, including Docs, Sheets, and Slides. This allows for powerful real-time collaboration, where multiple people can work on the same document simultaneously. The platform's advanced search capabilities can recognize content within your files, including text in images and PDFs, making it incredibly easy to find what you're looking for. Sharing files and folders with others is simple and secure, with granular controls over who can view, comment on, or edit your content.\n\nFor individuals and teams who need to manage and collaborate on digital files, Google Drive is an essential tool. It eliminates the need for physical storage devices and makes sharing information effortless. Whether you're working on a team project, sharing family photos, or simply backing up your phone, Google Drive provides a reliable and intelligent solution. It’s your personal, secure cloud that keeps all your files safe and within reach.",
    "size": 70,
    "reviews": 27,
    "ratingAvg": 4.6,
    "downloads":9,
    "ratings": [
      { "name": "1 star", "count": 1900000 },
      { "name": "2 star", "count": 700000 },
      { "name": "3 star", "count": 1200000 },
      { "name": "4 star", "count": 3090567 },
      { "name": "5 star", "count": 21000000 }
    ]
  },
  {
     "image": "https://yt3.googleusercontent.com/fAu7hfrQGS7dLDKdBSEuqLLrWH2w0HutPYnQB2lggnGri2avrIDazsSfDy4I40SaQn32BYsm=s900-c-k-c0x00ffffff-no-rj",
    "title": "Daraz Online Shopping App",
    "companyName": "Daraz",
    "id": 6,
    "description": "Daraz is a leading online shopping platform in South Asia, offering a massive marketplace at your fingertips. It provides access to a wide variety of products across numerous categories, including electronics, fashion, home goods, and groceries. The app is designed to be a one-stop shop for all your needs, bringing the experience of a giant shopping mall directly to your mobile device. Its main purpose is to make shopping more convenient, accessible, and enjoyable for everyone.\n\nA key feature of Daraz is its focus on providing an authentic and trustworthy shopping experience. 'DarazMall' features official stores from hundreds of local and international brands, ensuring you get genuine products. The platform frequently hosts major sales events, flash deals, and offers exclusive vouchers, allowing customers to get the best prices. User reviews and ratings provide valuable insights to help you make informed purchasing decisions, while secure payment options and a clear return policy build customer confidence.\n\nFor anyone looking for a convenient and reliable online shopping experience, Daraz is the go-to platform in its region. It saves you the time and effort of traditional shopping by offering a vast selection and delivering products directly to your doorstep. Whether you're searching for the latest gadgets, trendy apparel, or everyday essentials, Daraz provides a seamless and feature-rich app to discover and purchase what you need.",
    "size": 65,
    "reviews": 41,
    "ratingAvg": 4.4,
    "downloads":2,
    "ratings": [
      { "name": "1 star", "count": 1100000 },
      { "name": "2 star", "count": 500000 },
      { "name": "3 star", "count": 890000 },
      { "name": "4 star", "count": 2508741 },
      { "name": "5 star", "count": 11000000 }
    ]
  },
 
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/7/7e/Gmail_icon_%282020%29.svg",
    "title": "Gmail",
    "companyName": "Google LLC",
    "id": 7,
    "description": "Gmail is a powerful and intelligent email service designed to make your communication more efficient and secure. It organizes your inbox by automatically sorting mail into categories like Primary, Social, and Promotions, helping you focus on what's important. With a generous amount of free storage, you can save years of messages and attachments without worry. The app's core principle is to keep your account safe, employing machine learning to block over 99.9% of spam, phishing, and malware from reaching your inbox.\n\nA standout feature is Gmail's deep integration with the Google Workspace ecosystem. You can start a video meeting in Google Meet or chat with a colleague in Google Chat directly from your inbox, turning Gmail into a central hub for communication. Smart features like Smart Compose and Smart Reply help you write emails faster by offering predictive text suggestions. Its powerful search functionality allows you to find any email or attachment instantly, no matter how old it is.\n\nFor anyone managing personal or professional correspondence, Gmail provides an organized, smart, and secure platform. It streamlines your workflow by reducing clutter and suggesting helpful actions, saving you time and effort. Whether you're collaborating on a project, organizing your travel plans, or simply keeping in touch, Gmail's robust feature set ensures your email experience is smooth and productive. It's an essential tool for modern communication.",
    "size": 68,
    "reviews": 123,
    "ratingAvg": 4.3,
    "downloads":10,
    "ratings": [
      { "name": "1 star", "count": 900000 },
      { "name": "2 star", "count": 400000 },
      { "name": "3 star", "count": 650000 },
      { "name": "4 star", "count": 1404123 },
      { "name": "5 star", "count": 6500000 }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/0/09/YouTube_full-color_icon_%282017%29.svg",
    "title": "YouTube",
    "companyName": "Google LLC",
    "id": 8,
    "description": "YouTube is the world's largest online video platform, offering a universe of content created by individuals and organizations from around the globe. It's a place to be entertained, educated, and inspired, with videos on virtually any topic imaginable. From music videos and vlogs to DIY tutorials and educational lectures, YouTube is a primary source of information and entertainment for billions. Its core mission is to give everyone a voice and show them the world.\n\nA unique aspect of YouTube is its thriving creator ecosystem. The platform provides tools for anyone to upload, share, and monetize their video content, which has given rise to a new generation of digital creators and influencers. The recommendation algorithm helps viewers discover content tailored to their interests, while features like live streaming, 'Shorts' for short-form video, and community posts allow for deeper engagement between creators and their audiences. This makes YouTube a dynamic and interactive community, not just a passive viewing experience.\n\nFor anyone with a curious mind, YouTube is an endless resource. It's a library, a concert hall, a classroom, and a stage all in one. Whether you want to learn a new skill, follow your favorite artists, or just relax with entertaining content, the platform has something for you. By democratizing video creation and distribution, YouTube has become an essential part of modern culture and a powerful platform for learning and connection.",
    "size": 120,
    "reviews": 157,
    "ratingAvg": 4.2,
    "downloads":12,
    "ratings": [
      { "name": "1 star", "count": 19000000 },
      { "name": "2 star", "count": 8000000 },
      { "name": "3 star", "count": 12000000 },
      { "name": "4 star", "count": 21234987 },
      { "name": "5 star", "count": 90000000 }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/c/ce/X_logo_2023.svg",
    "title": "X",
    "companyName": "X Corp.",
    "id": 9,
     "description": "X is the real-time information network where you can see what's happening in the world and join the public conversation. It's a platform defined by brevity and immediacy, where users share short updates, news, and opinions. The timeline is a constantly flowing stream of information, from breaking news headlines to commentary from public figures and everyday people. This makes it an indispensable tool for staying informed on events as they unfold, providing a raw and unfiltered look at global happenings.\n\nA unique feature of X is its role as a global town square. Hashtags organize conversations around specific topics, allowing users to tap into trending discussions and events instantly. 'Spaces' provide a venue for live audio conversations, enabling more nuanced and interactive discussions. The platform's open nature means you can follow and interact with anyone, from world leaders and journalists to celebrities and experts in any field, giving you direct access to a wide range of perspectives.\n\nFor people who want to stay on the pulse of the world, X is the ultimate resource. It’s where news breaks first and where global conversations take shape. By combining instant updates with public discourse, the app allows you to not only consume information but also participate in the dialogue. Whether you're following sports, politics, tech, or entertainment, X provides a dynamic and fast-paced environment to learn, share, and engage with what's happening right now.",
    "size": 110,
    "reviews": 298,
    "ratingAvg": 3.2,
    "downloads":8,
    "ratings": [
      { "name": "1 star", "count": 9000000 },
      { "name": "2 star", "count": 4500000 },
      { "name": "3 star", "count": 3800000 },
      { "name": "4 star", "count": 2576543 },
      { "name": "5 star", "count": 10000000 }
    ]
  },

  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/8/82/Telegram_logo.svg",
    "title": "Telegram",
    "companyName": "Telegram FZ-LLC",
    "id": 10,
   "description": "Telegram is a cloud-based instant messaging app renowned for its focus on speed, security, and versatility. It offers end-to-end encrypted 'Secret Chats' and ensures all other communications are heavily encrypted and stored in a secure, distributed cloud. This allows for seamless and instant synchronization of your messages across all your devices—phone, tablet, and desktop. The app is designed to be lightweight and fast, delivering messages more quickly than any other application, even on weak mobile connections.\n\nA key differentiator for Telegram is its powerful features for groups and communities. It supports 'Groups' with up to 200,000 members and 'Channels' for broadcasting messages to an unlimited audience, making it a favorite for large communities and organizations. The platform also allows users to send any type of file up to 2 GB in size, and its open API supports a thriving ecosystem of third-party bots that can perform a wide range of automated tasks, from providing news updates to playing games.\n\nFor users who value privacy, speed, and powerful features, Telegram is an exceptional choice. It offers a secure alternative to other messaging apps without compromising on functionality. Whether you're having a private conversation, managing a large online community, or sharing large files, Telegram provides a robust and reliable platform. It’s a tool built for power users who demand more from their messaging app, combining top-tier security with unmatched performance.",
    "size": 45,
    "reviews": 173,
    "ratingAvg": 4.4,
    "downloads":6,
    "ratings": [
      { "name": "1 star", "count": 1800000 },
      { "name": "2 star", "count": 600000 },
      { "name": "3 star", "count": 1100000 },
      { "name": "4 star", "count": 2390123 },
      { "name": "5 star", "count": 12000000 }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c0/Shazam_icon.svg/2048px-Shazam_icon.svg.png",
    "title": "Shazam: Find Music",
    "companyName": "Apple Inc.",
    "id": 27,
    "description": "Shazam is a magical app that can identify almost any song playing in your environment in just a few seconds. It answers the common question, 'What's that song?' with incredible speed and accuracy. By simply opening the app and letting it listen, you can discover the title, artist, and lyrics of the music around you. It's an essential tool for music lovers and anyone who is curious about the soundtrack of their world, from songs on the radio to music in a cafe or movie.\n\nA key feature of Shazam is its deep integration with major music streaming services. Once a song is identified, you can instantly open it in Spotify or Apple Music to listen to the full track, add it to a playlist, or watch the music video on YouTube. The app keeps a history of all your Shazams, so you can always revisit the songs you've discovered. It even works offline by saving a digital fingerprint of the audio and identifying it once you're back online.\n\nFor music discovery, Shazam is an unparalleled tool. It instantly connects you with the music you hear and want to remember, bridging the gap between passive listening and active engagement. By making song identification effortless, the app helps you build your music library and explore new artists. It's a must-have utility for anyone who loves music and never wants to let a great song slip away.",
    "size": 40,
    "reviews": 68,
    "ratingAvg": 4.5,
    "downloads":3,
    "ratings": [
      { "name": "1 star", "count": 400000 },
      { "name": "2 star", "count": 150000 },
      { "name": "3 star", "count": 350000 },
      { "name": "4 star", "count": 912345 },
      { "name": "5 star", "count": 5000000 }
    ]
  },
 
  {
       "image": "https://store-images.s-microsoft.com/image/apps.61963.9007199266243744.6b1e80ee-cc0e-458e-a67d-87ff151e91f3.0ed4b25a-5d89-4782-9739-772c2ca8680c",
    "title": "Picsart AI Photo Editor, Video",
    "companyName": "PicsArt, Inc.",
    "id": 12,
    "description": "Unleash your creativity with Picsart, the ultimate all-in-one AI-powered photo and video editor. Whether you're a social media influencer, a small business owner, or just love creating, Picsart provides every tool you need to bring your ideas to life. Dive into a suite of powerful AI tools like object removal, background replacement, and style transfers. Enhance your photos with thousands of customizable filters, trendy effects, and unique stickers, or design stunning collages with our easy-to-use templates.\n\nOur full-featured video editor allows you to trim clips, merge videos, add background music, and apply eye-catching effects to make your content stand out. A key feature of Picsart is its vast library of user-generated and premium content, including millions of stickers and editable templates that make professional-level design accessible to everyone. The built-in drawing tools offer a complete art studio with customizable brushes, layers, and professional drawing tools for digital artists.\n\nFor anyone looking to elevate their digital content, Picsart is a comprehensive creative suite. It simplifies complex editing tasks and provides endless inspiration through its global community of creators. By combining powerful AI technology with an intuitive interface and a massive content library, the app empowers you to produce stunning visuals with ease. It's your go-to platform for giving your content a unique, personal flair that truly stands out.",
    "size": 99,
    "reviews": 56,
    "ratingAvg": 4.5,
    "downloads":4,
    "ratings": [
      { "name": "1 star", "count": 4100000 },
      { "name": "2 star", "count": 1500000 },
      { "name": "3 star", "count": 2900000 },
      { "name": "4 star", "count": 6623456 },
      { "name": "5 star", "count": 45000000 }
    ]
  }

]